MJBeltran13/trioe_installer/boards.txt
# Trioe custom ESP32-S3 board
trioe_esp32_s3.name=TRIOE Dev Module
trioe_esp32_s3.upload.tool=esptool_py
trioe_esp32_s3.upload.tool.default=esptool_py
trioe_esp32_s3.upload.tool.network=esp_ota
trioe_esp32_s3.upload.maximum_size=1310720
trioe_esp32_s3.upload.maximum_data_size=327680
trioe_esp32_s3.upload.erase_cmd=
trioe_esp32_s3.upload.use_1200bps_touch=false
trioe_esp32_s3.upload.wait_for_upload_port=false
trioe_esp32_s3.serial.disableDTR=false
trioe_esp32_s3.serial.disableRTS=false
trioe_esp32_s3.build.tarch=xtensa
trioe_esp32_s3.build.bootloader_addr=0x0
trioe_esp32_s3.build.target=esp32s3
trioe_esp32_s3.build.mcu=esp32s3
trioe_esp32_s3.build.core=esp32
trioe_esp32_s3.build.variant=esp32s3
trioe_esp32_s3.build.board=ESP32S3_DEV
trioe_esp32_s3.build.usb_mode=1
trioe_esp32_s3.build.cdc_on_boot=1
trioe_esp32_s3.build.msc_on_boot=0
trioe_esp32_s3.build.dfu_on_boot=0
trioe_esp32_s3.build.f_cpu=240000000L
trioe_esp32_s3.build.flash_size=4MB
trioe_esp32_s3.build.flash_freq=80m
trioe_esp32_s3.build.flash_mode=dio
trioe_esp32_s3.build.boot=qio
trioe_esp32_s3.build.boot_freq=80m
trioe_esp32_s3.build.partitions=default
trioe_esp32_s3.build.loop_core=
trioe_esp32_s3.build.event_core=
trioe_esp32_s3.build.psram_type=qspi
trioe_esp32_s3.build.memory_type={build.boot}_{build.psram_type}

trioe_esp32_s3.menu.PSRAM.disabled=Disabled
trioe_esp32_s3.menu.PSRAM.disabled.build.psram_type=qspi
trioe_esp32_s3.menu.PSRAM.enabled=QSPI PSRAM
trioe_esp32_s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
trioe_esp32_s3.menu.PSRAM.enabled.build.psram_type=qspi
trioe_esp32_s3.menu.PSRAM.opi=OPI PSRAM
trioe_esp32_s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
trioe_esp32_s3.menu.PSRAM.opi.build.psram_type=opi
